org/blog/drafts/mnist_bayesian_mlp.org
#+TITLE: Bayesian NN: MNIST

In this article we look at bayesian neural networks with Blackjax and see what kind of interesting stuff we can say about it.

* TODO Why do you need Bayes for probabilities?

[Link to AMA]

** TODO Show images on which the model is unsure
** TODO Distribution of mistakes for each digit.
** TODO Show results for the same digit rotated
** TODO Show results for noise
** TODO Remove unsure to increase accuracy
** TODO Marginalize to get the probability that they belong to each category
** TODO Can distributions pre-marginalization tell us something useful?

* TODO Models

This is an opportunity to showcase:
1. BlackJAX's algorithms (SGLD, NUTS, and the new Langevin thing for discrete variables)
2. The integration of BlackJAX with the rest of the JAX exosystem (Flax)

** TODO 3 layer MLP
** TODO CNN
** TODO Binary NN
