blog/drafts/mnist_bayesian_mlp.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-12-01 Thu 10:36 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Bayesian NN: MNIST</title>
<meta name="author" content="Rémi Louf" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css" /></head>
<body>
<div id="content" class="content">
<h1 class="title">Bayesian NN: MNIST</h1>
<p>
In this article we look at bayesian neural networks with Blackjax and see what kind of interesting stuff we can say about it.
</p>

<div id="outline-container-org93b6a9a" class="outline-2">
<h2 id="org93b6a9a"><span class="todo TODO">TODO</span> Why do you need Bayes for probabilities?</h2>
<div class="outline-text-2" id="text-org93b6a9a">
<p>
[Link to AMA]
</p>
</div>

<div id="outline-container-org2a2db3d" class="outline-3">
<h3 id="org2a2db3d"><span class="todo TODO">TODO</span> Show images on which the model is unsure</h3>
</div>
<div id="outline-container-org3e4230e" class="outline-3">
<h3 id="org3e4230e"><span class="todo TODO">TODO</span> Distribution of mistakes for each digit.</h3>
</div>
<div id="outline-container-org7c92390" class="outline-3">
<h3 id="org7c92390"><span class="todo TODO">TODO</span> Show results for the same digit rotated</h3>
</div>
<div id="outline-container-org89ef4a2" class="outline-3">
<h3 id="org89ef4a2"><span class="todo TODO">TODO</span> Show results for noise</h3>
</div>
<div id="outline-container-orgb4569d2" class="outline-3">
<h3 id="orgb4569d2"><span class="todo TODO">TODO</span> Remove unsure to increase accuracy</h3>
</div>
<div id="outline-container-orge1cb17f" class="outline-3">
<h3 id="orge1cb17f"><span class="todo TODO">TODO</span> Marginalize to get the probability that they belong to each category</h3>
</div>
<div id="outline-container-org34638ce" class="outline-3">
<h3 id="org34638ce"><span class="todo TODO">TODO</span> Can distributions pre-marginalization tell us something useful?</h3>
</div>
</div>

<div id="outline-container-org9dda8d6" class="outline-2">
<h2 id="org9dda8d6"><span class="todo TODO">TODO</span> Models</h2>
<div class="outline-text-2" id="text-org9dda8d6">
<p>
This is an opportunity to showcase:
</p>
<ol class="org-ol">
<li>BlackJAX's algorithms (SGLD, NUTS, and the new Langevin thing for discrete variables)</li>
<li>The integration of BlackJAX with the rest of the JAX exosystem (Flax)</li>
</ol>
</div>

<div id="outline-container-orge11c535" class="outline-3">
<h3 id="orge11c535"><span class="todo TODO">TODO</span> 3 layer MLP</h3>
</div>
<div id="outline-container-org94c95ac" class="outline-3">
<h3 id="org94c95ac"><span class="todo TODO">TODO</span> CNN</h3>
</div>
<div id="outline-container-org3ae16a1" class="outline-3">
<h3 id="org3ae16a1"><span class="todo TODO">TODO</span> Binary NN</h3>
</div>
</div>
</div>
</body>
</html>